app/views/users/show.html.erb

SELECT "donations".* FROM "donations" WHERE "donations"."user_id" = ?  [["user_id", 1]]
---

<% @user.donations.each do |donation|%>