app/views/donations/new.html.erb

SELECT "users".* FROM "users"
---
    <%= f.label :user %>
    <%= f.collection_select(:user_id, User.all, :id, :name)%>

SELECT "charities".* FROM "charities"
---
    <%= f.label :charity %>
    <%= f.collection_select(:charity_id, Charity.all, :id, :name)%>