app/controllers/charities_controller.rb

    def index
        @charities = Charity.all
---
SELECT "charities".* FROM "charities"

    def show
        @charity = Charity.find(params[:id])
---
SELECT  "charities".* FROM "charities" WHERE "charities"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]