app/controllers/donations_controller.rb

    def index
        #finds largest donation
        @donation_amounts = Donation.all.map do |donation|
            donation.amount
        end
        @largest_donation_amount = @donation_amounts.max
        @largest_donation = Donation.find_by(amount: @largest_donation_amount)
        @user_with_largest_donation = User.find(@largest_donation.user_id)

        #finds most donated to charity
        @charities = Charity.all
        @charities_donations = Donation.all.map do |donation|
            donation.charity_id
        end
        @donations_for_each_charity = Hash[@charities_donations.uniq.map {|i| [i, @charities_donations.count(i)]}]
        @most_donated_to = @donations_for_each_charity.values.max
        @most_donated_to_charity = Charity.find(@donations_for_each_charity.key(@most_donated_to))

        #find user with most donations
        @users_donations = Donation.all.map do |donation|
            donation.user_id
        end
        @donations_for_each_user = Hash[@users_donations.uniq.map {|i| [i, @users_donations.count(i)]}]
        @most_donations = @donations_for_each_user.values.max
        @user_with_most_donations = User.find(@donations_for_each_user.key(@most_donations))
---
SELECT  "charities".* FROM "charities" WHERE "charities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def new
        @donation = Donation.new
        @users = User.all
        @charities = Charity.all
---
SELECT "users".* FROM "users"
SELECT "charities".* FROM "charities"

    def create
        @donation = Donation.new(donation_params)
        if @donation.valid?
            @donation.save
---
INSERT INTO "donations" ("user_id", "charity_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["charity_id", 1], ["amount", 100], ["created_at", "2019-03-25 21:26:46.591780"], ["updated_at", "2019-03-25 21:26:46.591780"]]