app/controllers/donations_controller.rb

INSERT INTO "donations" ("user_id", "charity_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["charity_id", 1], ["amount", 100], ["created_at", "2019-03-25 21:26:46.591780"], ["updated_at", "2019-03-25 21:26:46.591780"]]
---
    def create
        @donation = Donation.new(donation_params)
        @donation.save