app/controllers/user_rewards_controller.rb

    def show
        @user_reward = UserReward.find(params[:id])
---
SELECT  "user_rewards".* FROM "user_rewards" WHERE "user_rewards"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]